 from pandas import S

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as  pd

In [5]:
string_data = Series(['aardvark',  'artichoke', np.nan, 'avocado'])

In [4]:
import numpy as np

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

In [11]:
data = Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]
                 ])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = DataFrame(np.random.randn(7,3))

In [22]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0  1.129640       NaN       NaN
1 -0.974350       NaN       NaN
2 -0.338209       NaN -2.117927
3  0.100163       NaN -0.355200
4  1.191426 -0.628994  2.386834
5 -1.217539 -0.360745  0.615755
6  0.839690 -0.336783 -0.533798

In [26]:
df.dropna()

          0         1         2
4  1.191426 -0.628994  2.386834
5 -1.217539 -0.360745  0.615755
6  0.839690 -0.336783 -0.533798

In [27]:
df.dropna(thresh=2)

          0         1         2
2 -0.338209       NaN -2.117927
3  0.100163       NaN -0.355200
4  1.191426 -0.628994  2.386834
5 -1.217539 -0.360745  0.615755
6  0.839690 -0.336783 -0.533798

In [29]:
df

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445 -0.065851  0.120339
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189  0.204626 -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [31]:
df.iloc[1,1] = NA

In [32]:
df

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445       NaN  0.120339
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189  0.204626 -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [33]:
df.iloc[4,1] = NA

In [34]:
df

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445       NaN  0.120339
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189       NaN -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [36]:
df.dropna(thresh=1)

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445       NaN  0.120339
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189       NaN -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [37]:
df.iloc[1,2] = NA

In [38]:
df

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445       NaN       NaN
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189       NaN -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [39]:
df.dropna(thresh=2)

          0         1         2
0 -0.620172 -0.894068  0.542642
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189       NaN -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [40]:
df.fillna(0)

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445  0.000000  0.000000
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189  0.000000 -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [41]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445  0.500000  0.000000
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189  0.500000 -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [42]:
_ = df.fillna(0, inplace=True)

In [43]:
df

          0         1         2
0 -0.620172 -0.894068  0.542642
1 -0.114445  0.000000  0.000000
2  0.832328 -0.348050 -0.159041
3  0.308598  0.977865 -0.333138
4  0.587189  0.000000 -0.276375
5  1.378071  0.280681 -0.541858
6 -0.257746 -2.093095  0.783979

In [44]:
df = DataFrame(np.random.randn(6,3))

In [45]:
df.iloc[2:,1] = NA

In [46]:
df.iloc[4:,2] = NA

In [47]:
df

          0         1         2
0 -0.345106  0.954203  0.291095
1  0.467196  0.237734 -0.428085
2  0.079928       NaN -0.565634
3  0.494969       NaN  0.641106
4 -0.620096       NaN       NaN
5 -1.948132       NaN       NaN

In [49]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.345106  0.954203  0.291095
1  0.467196  0.237734 -0.428085
2  0.079928  0.237734 -0.565634
3  0.494969  0.237734  0.641106
4 -0.620096       NaN  0.641106
5 -1.948132       NaN  0.641106

In [50]:
data = Series([1., NA, 3.5, NA, 7])

In [53]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [56]:
data = DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1,1,2,3,3,4,4]})

data

In [57]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [58]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [59]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [60]:
data['v1'] = range(7)

In [62]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [63]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [64]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham',  'nova lox'], 'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [65]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [71]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [67]:
lowercased = data['food'].str.lower()

In [68]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [72]:
data['animal'] = lowercased.map(meat_to_animal)

In [73]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [74]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [75]:
data = Series([1., -999., 2., -999, -1000, 3])

In [76]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [77]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [78]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [79]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [80]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data = DataFrame(np.arange(12).reshape)